# Pandasで2つのデータを横方向に結合するmerge関数の使い方

#### https://deepage.net/features/pandas-merge.html

In [16]:
#必要なライブラリをインポート
import pandas as pd
import os

In [17]:
os.getcwd()

'/Users/motegihayato/Sync/hayato.dailylife@gmail.com/data_science/jupyterlab/test/merge'

In [14]:
df1 = pd.DataFrame({
    'data1' : range(6),
    'key' : ['A', 'B', 'B', 'A', 'C', 'A']
})

In [15]:
df2 = pd.DataFrame({
    'data2' : range(2),
    'key' : ['A', 'B']
})

In [20]:
display(df1)
display(df2)

   data1 key
0      0   A
1      1   B
2      2   B
3      3   A
4      4   C
5      5   A

   data2 key
0      0   A
1      1   B

   data1 key  data2
0      0   A      0
1      3   A      0
2      5   A      0
3      1   B      1
4      2   B      1

In [21]:
display(pd.merge(df1, df2))
display(df1.merge(df2))

   data1 key  data2
0      0   A      0
1      3   A      0
2      5   A      0
3      1   B      1
4      2   B      1

   data1 key  data2
0      0   A      0
1      3   A      0
2      5   A      0
3      1   B      1
4      2   B      1